# SlabShapeFailedNotOnlyLines Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlabShapeFailures..::..SlabShapeFailedNotOnlyLines Property
BuiltInFailures..::..SlabShapeFailures Class See Also
---
The Floor or Roof or Toposolid may only contain straight lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlabShapeFailedNotOnlyLines { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlabShapeFailedNotOnlyLines As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlabShapeFailedNotOnlyLines {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SlabShapeFailures Class
Autodesk.Revit.DB Namespace